ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/bl_usb/bl_usb.c
/**
 * @file hal_usb.c
 * @brief
 *
 * Copyright (c) 2021 Bouffalolab team
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 */
#include "bl_usb.h"

#include <csi_core.h>
#include <drv/irq.h>
#include "bl606p_usb.h"
#include "bl606p_glb.h"
#include "bl_os_hal.h"

#define CONFIG_USB_VDMA_ENABLE
// #define CONFIG_USB_PINGPONG_ENABLE

#define user_log(M, ...) do {  printf("[%9lld]======[%s:%d] " M "",  \
                                 bl_os_clock_gettime_ms(),          \
                                 __func__,                       \
                                 __LINE__,                       \
                                 ##__VA_ARGS__);                 \
                               } while(0==1)

#define USB_DC_LOG_DBG(a, ...)
#define USB_DC_LOG_ERR  user_log//(a, ...) //bflb_platform_printf(a, ##__VA_ARGS__)

static uint8_t fifo_ep_map[4] = { 0, 0, 0, 0 };

static usb_dc_device_t usb_hs_device __attribute__((section(".RW_OCRAM_NOINIT")));
static void USBD_IRQHandler(void *arg);

static uint8_t usb_ep_is_enabled(uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    /* Check if ep enabled */
    if ((USB_EP_DIR_IS_OUT(ep)) &&
        usb_hs_device.out_ep[ep_idx].ep_ena) {
        return 1;
    } else if ((USB_EP_DIR_IS_IN(ep)) &&
               usb_hs_device.in_ep[ep_idx].ep_ena) {
        return 1;
    }

    return 0;
}

static int usb_vdma_write(uint8_t fifo_num, const uint8_t *data, uint32_t len, uint32_t timeout)
{
    USB_VDMA_Cfg_Type vdma_fifo_cfg;

    vdma_fifo_cfg.dir = USB_VDMA_TRANS_DIR_MEM_2_FIFO;
    vdma_fifo_cfg.memAddr = (uint32_t)(uintptr_t)data;
    vdma_fifo_cfg.length = len;

    csi_dcache_clean_range((uint32_t *)data, len);

    USB_Set_VDMA_Config(fifo_num, &vdma_fifo_cfg);
    USB_Set_VDMA_Start(fifo_num);

    while (USB_Get_VDMA_Start(fifo_num)) {
        if (USB_FOREVER == timeout) {
            bl_os_msleep(1);
        } else {
            if (!timeout) {
                USB_DC_LOG_ERR("fifo%d wait free timeout\r\n", fifo_num);
                return -USB_DC_EP_TIMEOUT_ERR;
            }
            bl_os_msleep(1);
            timeout--;
        }
    }

    return 0;
}

static int usb_vdma_read(uint8_t fifo_num, const uint8_t *data, uint32_t len, uint32_t timeout)
{
    uint32_t t = 0;
    USB_VDMA_Cfg_Type vdma_fifo_cfg;

    vdma_fifo_cfg.dir = USB_VDMA_TRANS_DIR_FIFO_2_MEM;
    vdma_fifo_cfg.memAddr = (uint32_t)(uintptr_t)data;
    vdma_fifo_cfg.length = len;
    USB_Set_VDMA_Config(fifo_num, &vdma_fifo_cfg);
    USB_Set_VDMA_Start(fifo_num);

    while (USB_Get_VDMA_Start(fifo_num)) {
        t++;
        if (t > 0x0FFFFFFF) {
            return -USB_DC_EP_TIMEOUT_ERR;
        }
    }
#if 0
    {
        if (USB_FOREVER == timeout) {
            bl_os_msleep(1);
        } else {
            if (!timeout) {
                USB_DC_LOG_ERR("fifo%d wait free timeout\r\n", fifo_num);
                return -USB_DC_EP_TIMEOUT_ERR;
            }
            bl_os_msleep(1);
            timeout--;
        }
    }
#endif
    csi_dcache_invalid_range((uint32_t *)data, len);
    return 0;
}

static uint8_t usb_get_transfer_fifo(uint8_t ep_idx)
{
    uint8_t target_fifo_id;

    if (usb_hs_device.out_ep[ep_idx].ep_cfg.ep_mps > 512 || usb_hs_device.in_ep[ep_idx].ep_cfg.ep_mps > 512) {
#ifdef CONFIG_USB_PINGPONG_ENABLE
        target_fifo_id = (4 * ep_idx - 3);
#else
        target_fifo_id = (2 * ep_idx - 1);
#endif
    } else {
#ifdef CONFIG_USB_PINGPONG_ENABLE
        target_fifo_id = (2 * ep_idx - 1);
#else
        target_fifo_id = ep_idx;
#endif
    }

    return target_fifo_id;
}

csi_dev_t g_usb0;

/**
 * @brief
 *
 * @param dev
 * @param oflag
 * @return int
 */
int usb_dc_init(void)
{
    csi_irq_disable(USB_IRQn);

    PDS_Turn_On_USB(1);

    /* interrupt config */
    USB_Global_IntEnable(DISABLE);

    /* software reset usb */
    USB_NORMAL_Cfg_Type usbNormalCfg = {
#ifdef CONFIG_USB_HS
        .forceFullSpeed = 0,
#else
        .forceFullSpeed = 1,
#endif
        .chipEn = 1,
        .swRst = 1,
        .remoteWakeupEn = 0,
        .rstTimeOut = 0xFFFF
    };
    USB_Set_Normal_Config(&usbNormalCfg);
#ifdef CONFIG_USB_HS
    USB_SOF_Mask_Time_HighSpeed();
#else
    USB_SOF_Mask_Time_FullSpeed();
#endif
    USB_Set_Device_Address(0);
    USB_Non_Ctrl_Transfer_Disable();

    USB_Reset_FIFO(USB_FIFO_0);
    USB_Reset_FIFO(USB_FIFO_1);
    USB_Reset_FIFO(USB_FIFO_2);
    USB_Reset_FIFO(USB_FIFO_3);
    USB_Clear_CTRL_FIFO();

    USB_Group_IntMask(USB_GRP_INT_G0, UNMASK);
    USB_Group_IntMask(USB_GRP_INT_G1, UNMASK);
    USB_Group_IntMask(USB_GRP_INT_G2, UNMASK);
    USB_Group_IntMask(USB_GRP_INT_G3, UNMASK);
    USB_Group_IntMask(USB_GRP_INT_G4, UNMASK);

    USB_Global_IntMask(USB_GLOBAL_INT_DEV, UNMASK);
    USB_Global_IntMask(USB_GLOBAL_INT_OTG, MASK);
    USB_Global_IntMask(USB_GLOBAL_INT_HC, MASK);

    USB_Sub_Group_IntMask(USB_INT_DMA_CMPLT | USB_INT_DMA_ERROR | USB_INT_IDLE | USB_INT_RX0BYTE | USB_INT_TX0BYTE);
    USB_Sub_Group_IntMask(USB_INT_VDMA_CMPLT_CXF | USB_INT_VDMA_CMPLT_F0 | USB_INT_VDMA_CMPLT_F1 | USB_INT_VDMA_CMPLT_F2 | USB_INT_VDMA_CMPLT_F3 |
                          USB_INT_VDMA_ERROR_CXF | USB_INT_VDMA_ERROR_F0 | USB_INT_VDMA_ERROR_F1 | USB_INT_VDMA_ERROR_F2 | USB_INT_VDMA_ERROR_F3);

    USB_Sub_Group_IntUnmask(USB_INT_CX_SETUP | USB_INT_CX_IN | USB_INT_CX_OUT | USB_INT_CX_COMFAIL | USB_INT_CX_COMABORT);
    USB_Sub_Group_IntUnmask(USB_INT_RESET | USB_INT_SUSPEND | USB_INT_RESUME);

    USB_Get_Sub_Group_0_IntClear(USB_SUB_GROUP_0_CX_COMABORT_BIT_MUSK);
    USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_RESET_BIT_MUSK | USB_SUB_GROUP_2_SUSPEND_BIT_MUSK | USB_SUB_GROUP_2_RESUME_BIT_MUSK |
                                 USB_SUB_GROUP_2_TX0BYTE_BIT_MUSK | USB_SUB_GROUP_2_RX0BYTE_BIT_MUSK |
                                 USB_SUB_GROUP_2_CMPLT_BIT_MUSK | USB_SUB_GROUP_2_ERROR_BIT_MUSK);
    USB_Get_Sub_Group_3_IntClear(0xffffffff); //VDMA INT
    USB_Get_Sub_Group_4_IntClear(USB_SUB_GROUP_4_L1_BIT_MUSK);

