ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/bl_usb/bl_usb.c
#ifdef CONFIG_USB_VDMA_ENABLE
    USB_Set_VDMA_Enable();
#endif

    memset(&usb_hs_device, 0, sizeof(usb_hs_device));

    usb_hs_device.out_ep[0].ep_ena = 1U;
    usb_hs_device.in_ep[0].ep_ena = 1U;
    usb_hs_device.out_ep[0].ep_cfg.ep_mps = 64;
    usb_hs_device.out_ep[0].ep_cfg.ep_type = USBD_EP_TYPE_CTRL;
    usb_hs_device.in_ep[0].ep_cfg.ep_mps = 64;
    usb_hs_device.in_ep[0].ep_cfg.ep_type = USBD_EP_TYPE_CTRL;

    //csi_irq_attach(USB_IRQn, USBD_IRQHandler, (void *)&usb_hs_device);
    csi_irq_attach(USB_IRQn, USBD_IRQHandler, (void *)&g_usb0);
    csi_irq_enable(USB_IRQn);

    USB_SoftDetach_Disable();
    USB_Global_IntEnable(ENABLE);

    return 0;
}

/**
 * @brief Set USB device address
 *
 * @param[in] addr Device address
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_set_address(const uint8_t addr)
{
    USB_Set_Device_Address(addr);
    return 0;
}

/**
 * @brief configure and enable endpoint
 * This function sets endpoint configuration according to one specified in USB
 * endpoint descriptor and then enables it for data transfers.
 *
 * @param dev
 * @param ep_cfg  ep_cfg Endpoint
 * @return int
 */
int usbd_ep_open(const struct usb_dc_ep_cfg *ep_cfg)
{
    uint8_t ep;
    USB_FIFO_Cfg_Type fifo_cfg;

    if (!ep_cfg) {
        return -1;
    }

    ep = ep_cfg->ep_addr;

    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (ep_idx > 4) {
        return -1;
    }

    USB_DC_LOG_DBG("%s ep %x, mps %d, type %d\r\n", __func__, ep, ep_cfg->ep_mps, ep_cfg->ep_type);

    if (ep_idx == 0) {
        return 0;
    }

    fifo_cfg.enable = 1;
    fifo_cfg.fifoType = ep_cfg->ep_type;
    fifo_cfg.epID = ep_idx;

    if (USB_EP_DIR_IS_OUT(ep)) {
        fifo_cfg.dir = USB_FIFO_DIR_OUT;
        usb_hs_device.out_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_hs_device.out_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
        usb_hs_device.out_ep[ep_idx].ep_ena = 1U;

        USB_Set_Endpoint_OUT_MaxPacketSize(ep_idx, ep_cfg->ep_mps);

    } else {
        fifo_cfg.dir = USB_FIFO_DIR_IN;
        usb_hs_device.in_ep[ep_idx].ep_cfg.ep_mps = ep_cfg->ep_mps;
        usb_hs_device.in_ep[ep_idx].ep_cfg.ep_type = ep_cfg->ep_type;
        usb_hs_device.in_ep[ep_idx].ep_ena = 1U;

        USB_Set_Endpoint_IN_MaxPacketSize(ep_idx, ep_cfg->ep_mps);
    }

#ifndef CONFIG_USB_PINGPONG_ENABLE
    fifo_cfg.blockType = USB_FIFO_BLOCK_CNT_SINGLE_BLOCK;

    if (ep_cfg->ep_mps <= 512) {
        if (ep_idx > 4) {
            return -1;
        }
        fifo_ep_map[0] = 0x01;
        fifo_ep_map[1] = 0x02;
        fifo_ep_map[2] = 0x03;
        fifo_ep_map[3] = 0x04;

        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_1, USB_FIFO_0);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_1, USB_FIFO_0);
        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_2, USB_FIFO_1);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_2, USB_FIFO_1);
        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_3, USB_FIFO_2);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_3, USB_FIFO_2);
        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_4, USB_FIFO_3);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_4, USB_FIFO_3);

        fifo_cfg.blockSize = USB_FIFO_BLOCK_MAX_SIZE_512;
        USB_Set_FIFO_Config(ep_idx - 1, &fifo_cfg);

        if (USB_EP_DIR_IS_OUT(ep)) {
            USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP1_INT_F0_OUT + 2 * (ep_idx - 1)));
        } else {
            USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP3_INT_VDMA_CMPLT_F0 + (ep_idx - 1)));
        }

        if (ep_cfg->ep_type == 0x01) {
            uint32_t tmpVal;
            tmpVal = BL_RD_WORD(USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (ep_idx - 1));
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_TX_NUM_HBW_IEP1, 0);
            BL_WR_WORD(USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (ep_idx - 1), tmpVal);
        }
    } else {
        if (ep_idx > 2) {
            return -1;
        }

        if (ep_cfg->ep_type == 0x01) {
            fifo_ep_map[0] = 0x01;
            fifo_ep_map[1] = 0x01;
            fifo_ep_map[2] = 0x01;
            fifo_ep_map[3] = 0x01;

            USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_1, USB_FIFO_0);
            USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_1, USB_FIFO_0);
            fifo_cfg.blockType = USB_FIFO_BLOCK_CNT_DOUBLE_BLOCKS;
            fifo_cfg.blockSize = USB_FIFO_BLOCK_MAX_SIZE_1024;
            USB_Set_FIFO_Config(2 * ep_idx - 2, &fifo_cfg);
            fifo_cfg.enable = 0;
            USB_Set_FIFO_Config(2 * ep_idx - 1, &fifo_cfg);
            USB_Set_FIFO_Config(2 * ep_idx, &fifo_cfg);
            USB_Set_FIFO_Config(2 * ep_idx + 1, &fifo_cfg);

            uint32_t tmpVal;
            tmpVal = BL_RD_WORD(USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (ep_idx - 1));
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, USB_TX_NUM_HBW_IEP1, 2);
            BL_WR_WORD(USB_BASE + USB_DEV_INMPS1_OFFSET + 0x04 * (ep_idx - 1), tmpVal);

            if (USB_EP_DIR_IS_OUT(ep)) {
                USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP1_INT_F0_OUT));
            } else {
                USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP3_INT_VDMA_CMPLT_F0));
            }
        } else {
            fifo_ep_map[0] = 0x01;
            fifo_ep_map[1] = 0x01;
            fifo_ep_map[2] = 0x02;
            fifo_ep_map[3] = 0x02;

            USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_1, USB_FIFO_0);
            USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_1, USB_FIFO_0);
            USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_2, USB_FIFO_2);
            USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_2, USB_FIFO_2);

            fifo_cfg.blockSize = USB_FIFO_BLOCK_MAX_SIZE_1024;
            USB_Set_FIFO_Config(2 * ep_idx - 2, &fifo_cfg);
            fifo_cfg.enable = 0;
            USB_Set_FIFO_Config(2 * ep_idx - 1, &fifo_cfg);

            if (USB_EP_DIR_IS_OUT(ep)) {
                USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP1_INT_F0_OUT + 4 * (ep_idx - 1)));
            } else {
                USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP3_INT_VDMA_CMPLT_F0 + 2 * (ep_idx - 1)));
            }
        }
    }
#else
    fifo_cfg.blockType = USB_FIFO_BLOCK_CNT_DOUBLE_BLOCKS;

    if (ep_cfg->ep_mps <= 512) {
        if (ep_idx > 2) {
            return -1;
        }
        fifo_ep_map[0] = 0x01;
        fifo_ep_map[1] = 0x01;
        fifo_ep_map[2] = 0x02;
        fifo_ep_map[3] = 0x02;

        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_1, USB_FIFO_0);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_1, USB_FIFO_0);
        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_2, USB_FIFO_2);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_2, USB_FIFO_2);

