ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/bl_usb/bl_usb.c
        fifo_cfg.blockSize = USB_FIFO_BLOCK_MAX_SIZE_512;
        USB_Set_FIFO_Config(2 * ep_idx - 2, &fifo_cfg);
        fifo_cfg.enable = 0;
        USB_Set_FIFO_Config(2 * ep_idx - 1, &fifo_cfg);

        if (USB_EP_DIR_IS_OUT(ep)) {
            USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP1_INT_F0_OUT + 4 * (ep_idx - 1)));
        } else {
            USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP3_INT_VDMA_CMPLT_F0 + 2 * (ep_idx - 1)));
        }
    } else {
        if (ep_idx > 1) {
            return -1;
        }

        fifo_ep_map[0] = 0x01;
        fifo_ep_map[1] = 0x01;
        fifo_ep_map[2] = 0x01;
        fifo_ep_map[3] = 0x01;

        USB_Set_FIFO_Of_Endpoint_IN(USB_Endpoint_1, USB_FIFO_0);
        USB_Set_FIFO_Of_Endpoint_OUT(USB_Endpoint_1, USB_FIFO_0);

        fifo_cfg.blockSize = USB_FIFO_BLOCK_MAX_SIZE_1024;
        USB_Set_FIFO_Config(2 * ep_idx - 2, &fifo_cfg);
        fifo_cfg.enable = 0;
        USB_Set_FIFO_Config(2 * ep_idx - 1, &fifo_cfg);
        USB_Set_FIFO_Config(2 * ep_idx, &fifo_cfg);
        USB_Set_FIFO_Config(2 * ep_idx + 1, &fifo_cfg);

        if (USB_EP_DIR_IS_OUT(ep)) {
            USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP1_INT_F0_OUT));
        } else {
            USB_Sub_Group_IntUnmask(1ULL << (USB_SUB_GRP3_INT_VDMA_CMPLT_F0));
        }
    }
#endif

    USB_Non_Ctrl_Transfer_Enable();

    return 0;
}

/**
 * @brief Disable the selected endpoint
 *
 * Function to disable the selected endpoint. Upon success interrupts are
 * disabled for the corresponding endpoint and the endpoint is no longer able
 * for transmitting/receiving data.
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_close(const uint8_t ep)
{
    return 0;
}
/**
 * @brief Set stall condition for the selected endpoint
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_set_stall(const uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (USB_EP_DIR_IS_OUT(ep)) {
        if (ep_idx == 0) {
            USB_Set_CTRL_Endpoint_Stall_Once();
        } else {
            USB_Set_Endpoint_OUT_Stall(ep_idx, ENABLE);
            usb_hs_device.out_ep[ep_idx].is_stalled = 1U;
        }
    } else {
        if (ep_idx == 0) {
            USB_Set_CTRL_Endpoint_Stall_Once();
        } else {
            USB_Set_Endpoint_IN_Stall(ep_idx, ENABLE);
            usb_hs_device.in_ep[ep_idx].is_stalled = 1U;
        }
    }
    return 0;
}
/**
 * @brief Clear stall condition for the selected endpoint
 *
 * @param[in] ep Endpoint address corresponding to the one
 *               listed in the device configuration table
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_clear_stall(const uint8_t ep)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (ep_idx) {
        if (USB_EP_DIR_IS_OUT(ep)) {
            USB_Reset_Endpoint_OUT_Data_Toggle_Sequence(ep_idx);
            USB_Set_Endpoint_OUT_Stall(ep_idx, DISABLE);
            usb_hs_device.out_ep[ep_idx].is_stalled = 0;
        } else {
            USB_Reset_Endpoint_IN_Data_Toggle_Sequence(ep_idx);
            USB_Set_Endpoint_IN_Stall(ep_idx, DISABLE);
            usb_hs_device.in_ep[ep_idx].is_stalled = 0;
        }
    }
    return 0;
}
/**
 * @brief Check if the selected endpoint is stalled
 *
 * @param dev usb device
 * @param[in]  ep       Endpoint address corresponding to the one
 *                      listed in the device configuration table
 * @param[out] stalled  Endpoint stall status
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_is_stalled(const uint8_t ep, uint8_t *stalled)
{
    uint8_t ep_idx = USB_EP_GET_IDX(ep);

    if (!stalled) {
        return -1;
    }
    *stalled = 0U;
    if (ep_idx == 0)
        return 0;

    if (USB_EP_DIR_IS_OUT(ep)) {
        if (usb_hs_device.out_ep[ep_idx].is_stalled) {
            *stalled = 1U;
        }
    } else {
        if (usb_hs_device.in_ep[ep_idx].is_stalled) {
            *stalled = 1U;
        }
    }

    return 0;
}

/**
 * @brief Write data to the specified endpoint
 *
 * This function is called to write data to the specified endpoint. The
 * supplied usbd_endpoint_callback function will be called when data is transmitted
 * out.
 *
 * @param dev
 * @param[in]  ep        Endpoint address corresponding to the one
 *                       listed in the device configuration table
 * @param[in]  data      Pointer to data to write
 * @param[in]  data_len  Length of the data requested to write. This may
 *                       be zero for a zero length status packet.
 * @param[out] ret_bytes Bytes scheduled for transmission. This value
 *                       may be NULL if the application expects all
 *                       bytes to be written
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_write(const uint8_t ep, const uint8_t *data, uint32_t data_len, uint32_t *ret_bytes, uint32_t timeout)
{
    uint32_t target_fifo_id = 0;
    uint8_t mps_over_flag = 0;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    int ret = 0;
    /* Check if IN ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_IN) {
        return -USB_DC_EP_DIR_ERR;
    }

    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep)) {
        return -USB_DC_EP_EN_ERR;
    }

    if (!data && data_len) {
        USB_DC_LOG_ERR("data is null\r\n");
        return -USB_DC_ADDR_ERR;
    }

    if (ep_idx == 0) {
        if (!data_len) {
            /* enable ep0 transfer */
            USB_CTRL_Endpoint_Data_Transfer_Done();
            return USB_DC_OK;
        }
        if (data_len > usb_hs_device.in_ep[ep_idx].ep_cfg.ep_mps) {
            /* Check if transfer len is too big */
            data_len = usb_hs_device.in_ep[ep_idx].ep_cfg.ep_mps;
            mps_over_flag = 1;
        }

