ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/bl_usb/bl_usb.c
#ifdef CONFIG_USB_VDMA_ENABLE
        ret = usb_vdma_write(0, data, data_len, timeout);
#else
        ret = usb_dma_write(0, data, data_len);
#endif
        if (ret < 0) {
            return ret;
        }
        if (!mps_over_flag) {
            USB_CTRL_Endpoint_Data_Transfer_Done();
        }

    } else {
        if (!data_len) {
            /* send zlp */
            USB_Endpoint_Transmit_Zero_Length_Packet(ep_idx);
            while (1) {
                if (USB_Is_Endpoint_Transfer_Zero_Length_Packet(ep_idx)) {
                    USB_Clear_Endpoint_Transfer_Zero_Length_Packet_Status(ep_idx);
                    break;
                }
                timeout--;
                if (!timeout) {
                    USB_DC_LOG_ERR("ep%d wait free timeout\r\n", ep);
                    return -USB_DC_EP_TIMEOUT_ERR;
                }
            }
            return USB_DC_OK;
        }

        target_fifo_id = usb_get_transfer_fifo(ep_idx);
#ifdef CONFIG_USB_VDMA_ENABLE
        ret = usb_vdma_write(target_fifo_id, data, data_len, timeout);
#else
        ret = usb_dma_write(target_fifo_id, data, data_len);
#endif
        if (ret < 0) {
            return ret;
        }
    }

    USB_DC_LOG_DBG("EP%d write %u bytes\r\n", ep_idx, data_len);

    if (ret_bytes) {
        *ret_bytes = data_len;
    }

    return USB_DC_OK;
}

/**
 * @brief Read data from the specified endpoint
 *
 * This function is called by the endpoint handler function, after an OUT
 * interrupt has been received for that EP. The application must only call this
 * function through the supplied usbd_ep_callback function. This function clears
 * the ENDPOINT NAK when max_data_len is 0, if all data in the endpoint FIFO has been read,
 * so as to accept more data from host.
 *
 * @param[in]  ep           Endpoint address corresponding to the one
 *                          listed in the device configuration table
 * @param[in]  data         Pointer to data buffer to write to
 * @param[in]  max_data_len Max length of data to read
 * @param[out] read_bytes   Number of bytes read. If data is NULL and
 *                          max_data_len is 0 the number of bytes
 *                          available for read should be returned.
 *
 * @return 0 on success, negative errno code on fail.
 */
int usbd_ep_read(const uint8_t ep, uint8_t *data, uint32_t data_len, uint32_t *read_bytes, uint32_t timeout)
{
    uint32_t read_len = 0;
    uint32_t target_fifo_id = 0;
    uint8_t ep_idx = USB_EP_GET_IDX(ep);
    int ret = 0;

    /* Check if OUT ep */
    if (USB_EP_GET_DIR(ep) != USB_EP_DIR_OUT) {
        USB_DC_LOG_ERR("Wrong endpoint direction\r\n");
        return -USB_DC_EP_DIR_ERR;
    }

    /* Check if ep enabled */
    if (!usb_ep_is_enabled(ep)) {
        USB_DC_LOG_ERR("Not enabled endpoint\r\n");
        return -USB_DC_EP_EN_ERR;
    }

    if (!data && data_len) {
        USB_DC_LOG_ERR("data is null\r\n");
        return -USB_DC_ADDR_ERR;
    }

    /* Allow to read 0 bytes */
    if (!data_len) {
        return USB_DC_OK;
    }

    if (ep_idx == 0) {
        /*setup handler*/
        if ((data_len == 8) && !read_bytes) {
            USB_Get_Setup_Command((uint32_t *)data);
            return USB_DC_OK;
        } else {
            read_len = BL_GET_REG_BITS_VAL(BL_RD_REG(USB_BASE, USB_DEV_CXCFE), USB_CX_FNT);
#ifdef CONFIG_USB_VDMA_ENABLE
            ret = usb_vdma_read(0, data, read_len, timeout);
#else
            ret = usb_dma_read(0, data, read_len, timeout);
#endif
            if (ret < 0) {
                return ret;
            }
        }
    } else {
        target_fifo_id = usb_get_transfer_fifo(ep_idx);
        read_len = USB_Get_OUT_FIFO_Count(target_fifo_id - 1);
        if (read_len == 0) {
            if (read_bytes) {
                *read_bytes = 0;
            }
            return 0;
        }
#ifdef CONFIG_USB_VDMA_ENABLE
        ret = usb_vdma_read(target_fifo_id, data, read_len, timeout);
#else
        ret = usb_dma_read(target_fifo_id, data, read_len);
#endif
        if (ret < 0) {
            return ret;
        }
    }
    if (read_bytes) {
        *read_bytes = read_len;
    }
    USB_DC_LOG_DBG("Read EP%d, req %d, read %d bytes\r\n", ep, data_len, *read_bytes);

    return USB_DC_OK;
}

extern void usbd_event_notify_handler(uint8_t event, void *arg);

static void usb_group0_isr(void)
{
    uint32_t group0intstatus = USB_Get_Sub_Group_0_IntStatus() & ~USB_Get_Sub_Group_0_IntMask();

    if (group0intstatus & USB_SUB_GROUP_0_CX_COMABORT_BIT_MUSK) {
        /* CX_COMABT_INT  */
        USB_DC_LOG_ERR("CX COMABT\r\n");
        USB_Get_Sub_Group_0_IntClear(USB_SUB_GROUP_0_CX_COMABORT_BIT_MUSK);
        return;
    }
    if (group0intstatus & USB_SUB_GROUP_0_CX_COMFAIL_BIT_MUSK) {
        /* CX_COMFAIL_INT */
        USB_DC_LOG_ERR("CX COMFAIL\r\n");
        return;
    }
    if (group0intstatus & USB_SUB_GROUP_0_CX_OUT_BIT_MUSK) {
        /* CX_OUT_INT     */
        usbd_event_notify_handler(USB_DC_EVENT_EP0_OUT_NOTIFY, NULL);
        return;
    }
    if (group0intstatus & USB_SUB_GROUP_0_CX_IN_BIT_MUSK) {
        /* CX_IN_INT      */
        usbd_event_notify_handler(USB_DC_EVENT_EP0_IN_NOTIFY, NULL);
        return;
    }
    if (group0intstatus & USB_SUB_GROUP_0_CX_SETUP_BIT_MUSK) {
        /* CX_SETUP_INT   */
        usbd_event_notify_handler(USB_DC_EVENT_SETUP_NOTIFY, NULL);
        return;
    }
}
static void usb_group1_isr(void)
{
    uint32_t group1intstatus = USB_Get_Sub_Group_1_IntStatus() & ~USB_Get_Sub_Group_1_IntMask();

    if (group1intstatus & USB_SUB_GROUP_1_F0_OUT_BIT_MUSK) {
        /* F0_OUT_INT */
        usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[0] & 0x7f));
    }

    if (group1intstatus & USB_SUB_GROUP_1_F1_OUT_BIT_MUSK) {
        /* F1_OUT_INT */
        usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[1] & 0x7f));
    }

    if (group1intstatus & USB_SUB_GROUP_1_F2_OUT_BIT_MUSK) {
        /* F2_OUT_INT */
        usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[2] & 0x7f));
    }

    if (group1intstatus & USB_SUB_GROUP_1_F3_OUT_BIT_MUSK) {
        /* F3_OUT_INT */
        usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[3] & 0x7f));
    }

    if (group1intstatus & USB_SUB_GROUP_1_F0_IN_BIT_MUSK) {
        /* F0_IN_INT  */
        usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[0] | 0x80));
    }

