ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/bl_usb/bl_usb.c
    if (group1intstatus & USB_SUB_GROUP_1_F1_IN_BIT_MUSK) {
        /* F1_IN_INT  */
        usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[1] | 0x80));
    }

    if (group1intstatus & USB_SUB_GROUP_1_F2_IN_BIT_MUSK) {
        /* F2_IN_INT  */
        usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[2] | 0x80));
    }

    if (group1intstatus & USB_SUB_GROUP_1_F3_IN_BIT_MUSK) {
        /* F3_IN_INT  */
        usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[3] | 0x80));
    }
}
static void usb_group2_isr(void)
{
    uint32_t group2intstatus = USB_Get_Sub_Group_2_IntStatus() & ~USB_Get_Sub_Group_2_IntMask();

    if (group2intstatus & USB_SUB_GROUP_2_WAKEUP_BY_VBUS_BIT_MUSK) {
        /* Dev_Wakeup_byVBUS */
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_IDLE_BIT_MUSK) {
        /* Dev_Idle(HOV) */
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_ERROR_BIT_MUSK) {
        /* DMA_ERROR(HOV) */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_ERROR_BIT_MUSK);
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_CMPLT_BIT_MUSK) {
        /* DMA_CMPLT(HOV) */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_CMPLT_BIT_MUSK);
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_RX0BYTE_BIT_MUSK) {
        /* RX0BYTE_INT */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_RX0BYTE_BIT_MUSK);
        for (uint32_t i = USB_Endpoint_1; i <= USB_Endpoint_8; i++) {
            if (USB_Is_Endpoint_Receive_Zero_Length_Packet(i))
                USB_Clear_Endpoint_Receive_Zero_Length_Packet_Status(i);
        }
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_TX0BYTE_BIT_MUSK) {
        /* TX0BYTE_INT */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_TX0BYTE_BIT_MUSK);
        for (uint32_t i = USB_Endpoint_1; i <= USB_Endpoint_8; i++) {
            if (USB_Is_Endpoint_Transfer_Zero_Length_Packet(i))
                USB_Clear_Endpoint_Transfer_Zero_Length_Packet_Status(i);
        }
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_RESUME_BIT_MUSK) {
        /* RESM_INT */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_RESUME_BIT_MUSK);
        usbd_event_notify_handler(USB_DC_EVENT_RESUME, NULL);
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_SUSPEND_BIT_MUSK) {
        /* SUSP_INT */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_SUSPEND_BIT_MUSK);
        usbd_event_notify_handler(USB_DC_EVENT_SUSPEND, NULL);
        return;
    }
    if (group2intstatus & USB_SUB_GROUP_2_RESET_BIT_MUSK) {
        /* USBRST_INT */
        USB_Get_Sub_Group_2_IntClear(USB_SUB_GROUP_2_RESET_BIT_MUSK);
        USB_Non_Ctrl_Transfer_Disable();
        USB_Reset_FIFO(USB_FIFO_0);
        USB_Reset_FIFO(USB_FIFO_1);
        USB_Reset_FIFO(USB_FIFO_2);
        USB_Reset_FIFO(USB_FIFO_3);
        USB_Clear_CTRL_FIFO();

#ifdef CONFIG_USB_HS
        USB_SOF_Mask_Time_HighSpeed();
#else
        USB_SOF_Mask_Time_FullSpeed();
#endif
        usbd_event_notify_handler(USB_DC_EVENT_RESET, NULL);
        return;
    }
}
#ifdef CONFIG_USB_VDMA_ENABLE
static void usb_group3_isr(void)
{
    uint32_t group3intstatus = USB_Get_Sub_Group_3_IntStatus() & ~USB_Get_Sub_Group_3_IntMask();

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_CMPLT_CXF_BIT_MUSK) {
        /* VDMA_CMPLT_CXF */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_CMPLT_CXF_BIT_MUSK);
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_CMPLT_F0_BIT_MUSK) {
        /* VDMA_CMPLT_F0  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_CMPLT_F0_BIT_MUSK);
        if (usb_hs_device.in_ep[fifo_ep_map[0]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[0] | 0x80));
        } else if (usb_hs_device.out_ep[fifo_ep_map[0]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[0] & 0x7f));
        }
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_CMPLT_F1_BIT_MUSK) {
        /* VDMA_CMPLT_F1  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_CMPLT_F1_BIT_MUSK);
        if (usb_hs_device.in_ep[fifo_ep_map[1]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[1] | 0x80));
        } else if (usb_hs_device.out_ep[fifo_ep_map[1]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[1] & 0x7f));
        }
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_CMPLT_F2_BIT_MUSK) {
        /* VDMA_CMPLT_F2  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_CMPLT_F2_BIT_MUSK);
        if (usb_hs_device.in_ep[fifo_ep_map[2]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[2] | 0x80));
        } else if (usb_hs_device.out_ep[fifo_ep_map[2]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[2] & 0x7f));
        }
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_CMPLT_F3_BIT_MUSK) {
        /* VDMA_CMPLT_F3  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_CMPLT_F3_BIT_MUSK);
        if (usb_hs_device.in_ep[fifo_ep_map[3]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_IN_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[3] | 0x80));
        } else if (usb_hs_device.out_ep[fifo_ep_map[3]].ep_ena) {
            usbd_event_notify_handler(USB_DC_EVENT_EP_OUT_NOTIFY, (void *)(uintptr_t)(fifo_ep_map[3] & 0x7f));
        }
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_ERROR_CXF_BIT_MUSK) {
        /* VDMA_ERROR_CXF */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_ERROR_CXF_BIT_MUSK);
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_ERROR_F0_BIT_MUSK) {
        /* VDMA_ERROR_F0  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_ERROR_F0_BIT_MUSK);
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_ERROR_F1_BIT_MUSK) {
        /* VDMA_ERROR_F1  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_ERROR_F1_BIT_MUSK);
    }

