ndom91/pinevoice-realtime-firmware/components/chip_bl606p/drivers/bl_usb/bl_usb.c
    if (group3intstatus & USB_SUB_GROUP_3_VDMA_ERROR_F2_BIT_MUSK) {
        /* VDMA_ERROR_F2  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_ERROR_F2_BIT_MUSK);
    }

    if (group3intstatus & USB_SUB_GROUP_3_VDMA_ERROR_F3_BIT_MUSK) {
        /* VDMA_ERROR_F3  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_3_VDMA_ERROR_F3_BIT_MUSK);
    }
}
#endif
static void usb_group4_isr(void)
{
    uint32_t group4intstatus = USB_Get_Sub_Group_4_IntStatus() & ~USB_Get_Sub_Group_4_IntMask();

    if (group4intstatus & USB_SUB_GROUP_4_L1_BIT_MUSK) {
        /* L1_INT  */
        USB_Get_Sub_Group_3_IntClear(USB_SUB_GROUP_4_L1_BIT_MUSK);
        return;
    }
}

/**
 * @brief
 *
 */
void USBD_IRQHandler(void *arg)
{
    if (USB_Global_IntStatus(USB_GLOBAL_INT_DEV)) {
        /* group 0 int */
        if (USB_Group_IntStatus(USB_GRP_INT_G0)) {
            usb_group0_isr();
        }
        /* group 1 int */
        if (USB_Group_IntStatus(USB_GRP_INT_G1)) {
            usb_group1_isr();
        }
        /* group 2 int */
        if (USB_Group_IntStatus(USB_GRP_INT_G2)) {
            usb_group2_isr();
        }
#ifdef CONFIG_USB_VDMA_ENABLE
        /* group 3 int */
        if (USB_Group_IntStatus(USB_GRP_INT_G3)) {
            usb_group3_isr();
        }
#endif
        /* group 4 int */
        if (USB_Group_IntStatus(USB_GRP_INT_G4)) {
            usb_group4_isr();
        }
    }
}

#ifdef USB_TEST_MODE
void usbd_set_feature(uint16_t index, uint16_t value)
{
    switch (value) {
        case 0: //USB_FEATURE_ENDPOINT_HALT
            //implement in usb_dc_ep_set_stall
            break;
        case 1: //USB_FEATURE_REMOTE_WAKEUP
        {
            uint32_t tmpVal;
            tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_CAP_RMWAKUP);
            BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);
        } break;
        case 2: //USB_FEATURE_TEST_MODE
            switch (index >> 8) {
                case 1: // Test_J
                {
                    uint32_t tmpVal;
                    tmpVal = BL_RD_REG(USB_BASE, USB_PHY_TST);
                    tmpVal = BL_SET_REG_BIT(tmpVal, USB_TST_JSTA);
                    BL_WR_REG(USB_BASE, USB_PHY_TST, tmpVal);
                } break;
                case 2: // Test_K
                {
                    uint32_t tmpVal;
                    tmpVal = BL_RD_REG(USB_BASE, USB_PHY_TST);
                    tmpVal = BL_SET_REG_BIT(tmpVal, USB_TST_KSTA);
                    BL_WR_REG(USB_BASE, USB_PHY_TST, tmpVal);
                } break;
                case 3: // TEST_SE0_NAK
                {
                    uint32_t tmpVal;
                    tmpVal = BL_RD_REG(USB_BASE, USB_PHY_TST);
                    tmpVal = BL_SET_REG_BIT(tmpVal, USB_TST_SE0NAK);
                    BL_WR_REG(USB_BASE, USB_PHY_TST, tmpVal);
                } break;
                case 4: // Test_Packet
                {
                    uint32_t tmpVal;
                    tmpVal = BL_RD_REG(USB_BASE, USB_PHY_TST);
                    tmpVal = BL_SET_REG_BIT(tmpVal, USB_TST_PKT);
                    BL_WR_REG(USB_BASE, USB_PHY_TST, tmpVal);
                } break;
                case 5: // Test_Force_Enable
                {
                    uint8_t temp[53];
                    uint8_t *pp;
                    uint8_t i;
                    pp = temp;

                    for (i = 0; i < 9; i++) /*JKJKJKJK x 9*/
                        *pp++ = 0x00;

                    for (i = 0; i < 8; i++) /* 8*AA */
                        *pp++ = 0xAA;

                    for (i = 0; i < 8; i++) /* 8*EE */
                        *pp++ = 0xEE;

                    *pp++ = 0xFE;

                    for (i = 0; i < 11; i++) /* 11*FF */
                        *pp++ = 0xFF;

                    *pp++ = 0x7F;
                    *pp++ = 0xBF;
                    *pp++ = 0xDF;
                    *pp++ = 0xEF;
                    *pp++ = 0xF7;
                    *pp++ = 0xFB;
                    *pp++ = 0xFD;
                    *pp++ = 0xFC;
                    *pp++ = 0x7E;
                    *pp++ = 0xBF;
                    *pp++ = 0xDF;
                    *pp++ = 0xEF;
                    *pp++ = 0xF7;
                    *pp++ = 0xFB;
                    *pp++ = 0xFD;
                    *pp++ = 0x7E;

                    uint32_t tmpVal;
                    tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CXCFE);
                    tmpVal = BL_SET_REG_BIT(tmpVal, USB_TST_PKDONE);
                    BL_WR_REG(USB_BASE, USB_DEV_CXCFE, tmpVal);

                } break;

                default:
                    break;
            }
            break;
        case 3: //USB_FEATURE_BHNPENABLE
        {
            uint32_t tmpVal;
            tmpVal = BL_RD_REG(USB_BASE, USB_OTG_CSR);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_B_BUS_REQ);
            BL_WR_REG(USB_BASE, USB_OTG_CSR, tmpVal);

            tmpVal = BL_RD_REG(USB_BASE, USB_OTG_CSR);
            tmpVal = BL_SET_REG_BIT(tmpVal, USB_B_HNP_EN);
            BL_WR_REG(USB_BASE, USB_OTG_CSR, tmpVal);
        } break;
        case 4: //USB_FEATURE_AHNPSUPPORT

            break;
        case 5: //USB_FEATURE_AALTHNPSUPPORT

            break;

        default:
            break;
    }
}

void usbd_clear_feature(uint16_t index, uint16_t value)
{
    switch (value) {
        case 0: //USB_FEATURE_ENDPOINT_HALT
            //implement in usb_dc_ep_clear_stall
            break;
        case 1: //USB_FEATURE_REMOTE_WAKEUP
        {
            uint32_t tmpVal;
            tmpVal = BL_RD_REG(USB_BASE, USB_DEV_CTL);
            tmpVal = BL_CLR_REG_BIT(tmpVal, USB_CAP_RMWAKUP);
            BL_WR_REG(USB_BASE, USB_DEV_CTL, tmpVal);
        } break;

        default:
            break;
    }
}
#endif

void usb_clock_init(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(GLB_BASE, GLB_CGEN_CFG1);
    tmpVal |= (1 << 13);
    BL_WR_REG(GLB_BASE, GLB_CGEN_CFG1, tmpVal);
    GLB_Set_USB_CLK_From_WIFIPLL(1);
}

